Revit 2027 API
AnalysisDisplayStyle.GetElements Method
 Returns set of all analysis display styles elements in the given document.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetElements(
	Document document
)
Public Shared Function GetElements (
	document As Document
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetElements(
	Document^ document
)
static member GetElements :
        document : Document -> ICollection<ElementId>
Parameters
document Document
 Document from which analysis display style elements are retrieved.
Return Value
ICollection<ElementId>
 All analysis display style elements existing in the document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace